In [1]:
import pandas as pd

In [17]:
df = pd.read_excel("/storage/emulated/0/Cell_Phone_Service/proposals/market_report/Price_Tracker_v101.xlsx")

In [33]:
df.to_csv("data/raw/local_market_prices.csv")

In [36]:
df = pd.read_csv("data/prices.csv")

In [37]:
df.head()

     item  price
0   Apple    1.5
1  Banana    0.9
2   Apple    1.5
3  Banana    0.9

In [38]:
df.dropna()

     item  price
0   Apple    1.5
1  Banana    0.9
2   Apple    1.5
3  Banana    0.9

In [40]:
df.to_excel("data/clean/simple.xlsx")

In [41]:
df.to_csv("data/clean/simple.csv")

In [42]:
df

     item  price
0   Apple    1.5
1  Banana    0.9
2   Apple    1.5
3  Banana    0.9